# 산술연산과 주석 -----------------
6-2.5  # 3.5
8/2    # 4
8%%3   # 2
2^3    # 8

# 수학함수 ------------------------
# 로그함수
log(2) + 3      # 3.693147
log(10)         # 2.302585
log(10, base=2) # 3.321928

sqrt(36)      # 6
max(3,9,5)    # 9
min(3,9,5)    # 3
abs(-11.5)    # 11.5
factorial(5)  # 120
sin(pi/2)     # 1

#====================================
# 숫자형
a <- 10
b <- 20
c <- a + b
print(c) #변수 c에 저장된 값 출력

d <- "A"
e <- a + d #서로 다른 자료형(숫자 <-> 문자)의 연산은 오류 발생
print(e)

#문자형 '' 또는 "" 사용
size_1 <- "M"
size_2 <- 'L'
menu_1 <-  "Americano"
menu_2 <- 'Latte'
print(size_1)
print(size_2)
print(menu_1)
print(menu_2)

#논리형
a > b
a | b
a & b
a == b
a != b
